In [1]:
import numpy as np
import pandas as pd

In [4]:
sozluk = {"isim":["ahmet","mehmet","ali","garip"],
          "spor": ["koşu","yüzme","basketbol","koşu"],
         "kalori": [100,200,300,400]}

In [13]:
dataFrame1 = pd.DataFrame(sozluk,index=[0,2,3,3])

In [14]:
sozluk2 = {"isim":["ahme2t","mehmet2","ali2","garip2"],
          "spor": ["koşu","yüzme","basketbol","koşu"],
         "kalori": [1300,2030,3030,4030]}

In [15]:
dataFrame2=pd.DataFrame(sozluk2,index=[1,2,3,4])

In [11]:
sozluk3 = {"isim":["ahmet3","mehmet3","ali3","garip3"],
          "spor": ["koşu","yüzme","basketbol","koşu"],
         "kalori": [3100,1200,1300,470]}

In [16]:
dataFrame3= pd.DataFrame(sozluk3,index=[5,6,7,8])

In [17]:
#concatenetaion birleştirme#

In [19]:
pd.concat([dataFrame1,dataFrame2,dataFrame3]) # kolon isimleri yok #

      isim       spor  kalori
0   ahmet3       koşu    3100
2  mehmet3      yüzme    1200
3     ali3  basketbol    1300
3   garip3       koşu     470
1   ahme2t       koşu    1300
2  mehmet2      yüzme    2030
3     ali2  basketbol    3030
4   garip2       koşu    4030
5   ahmet3       koşu    3100
6  mehmet3      yüzme    1200
7     ali3  basketbol    1300
8   garip3       koşu     470

In [20]:
#eger hepsini yazarsak nan değerler olur altta#

In [23]:
 #pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 1)

In [24]:
#merge kaynaştırma birleştirme#

In [28]:
mergeS= {"isim":["ahmet","mehmet","ali"],"spor":["koşu","yüzme","basketbol"]}

In [29]:
mergeData = pd.DataFrame(mergeS)

In [32]:
mergeS2= {"isim":["ahmet","mehmet","ali"],"kalori":[100,200,300]}

In [33]:
mergeData2= pd.DataFrame(mergeS2)

In [34]:
mergeData2

     isim  kalori
0   ahmet     100
1  mehmet     200
2     ali     300

In [37]:
pd.merge(mergeData,mergeData2,on="isim")

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2     ali  basketbol     300

In [40]:
maasSozluk = {"isim":["atil","zeynep","mehmet"],
             "departman": ["yazılım","satış","kargo"],
             "maas":[200,300,400]}

In [41]:
maasData = pd.DataFrame(maasSozluk)

In [42]:
maasData

     isim departman  maas
0    atil   yazılım   200
1  zeynep     satış   300
2  mehmet     kargo   400

In [43]:
maasData["departman"]

0    yazılım
1      satış
2      kargo
Name: departman, dtype: object

In [45]:
maasData["departman"].unique()

array(['yazılım', 'satış', 'kargo'], dtype=object)

In [47]:
maasData["departman"].nunique() # kaç tane departman var

3

In [48]:
maasData["departman"].value_counts()

yazılım    1
satış      1
kargo      1
Name: departman, dtype: int64

In [52]:
def bruttenNete(maas):
    return maas * 0.66

In [53]:
maasData["maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
Name: maas, dtype: float64

In [55]:
maasData.isnull()# boş yer varmı yokmu

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False

In [69]:
yeniBirVeri={"karakter sınıfı":["kuzey","güney","güney"],
            "karakter ismi": ["maymn","sezer","sezer"],
            "karakter yas": [10,20,10]}

In [70]:
karakterData = pd.DataFrame(yeniBirVeri)

In [71]:
karakterData

  karakter sınıfı karakter ismi  karakter yas
0           kuzey         maymn            10
1           güney         sezer            20
2           güney         sezer            10

In [76]:
karakterData.pivot_table(values="karakter yas",index=["karakter sınıfı","karakter ismi"],aggfunc=np.sum)#toplama yapyım)

                               karakter yas
karakter sınıfı karakter ismi
güney           sezer                    30
kuzey           maymn                    10